Repository: nagyist/freezer-web-ui
Catalog: freezer_ui/locale/*/LC_MESSAGES/django.po
Languages: ru

source: A group of jobs which share the same scheduling time.
ru: Группа заданий, которые имеют одинаковое плановое время.

source: Action
ru: Действие

source: Action Configuration
ru: Конфигурация действия

source: Action Name
ru: Имя действия

source: Action Type
ru: Тип действия

source: Action queued correctly. It will appear soon.
ru: Действие добавлено в очередь корректно. Скоро появится.

source: Actions
ru: Действия

source: Actions Configuration
ru: Конфигурация действий

source: Actions saved correctly.
ru: Действия сохранены корректно.

source: Actions updated correctly.
ru: Действия обновлены правильно.

source: Admin
ru: Администратор

source: Advanced
ru: Расширенный

source: Advanced configuration
ru: Расширенная конфигурация

source: All Clients
ru: Все клиенты

source: Allow to access Swift servers without checking SSL certificates.
ru: Разрешить доступ к серверам Swift без проверки SSL-сертификатов.

source: Always Level
ru: Постоянный уровень

source: An action is the simplest execution within a job, it could be a backup or a restore and it contains rules that the action must follow (max retries, interval between executions, etc).
ru: Действие - это простейшее выполнение в задании. Это может быть резервное копирование или восстановление. Оно содержит правила, которым должно следовать действие (максимальное количество повторных попыток, интервал между выполнениями и т. д.).

source: Attach
ru: Привязать

source: Attach To Session
ru: Прикрепить к сессии

source: Available Actions
ru: Доступные действия

source: Backup
ru: Резервная копия

source: Backup History
ru: История резервной копии

source: Backup Name
ru: Имя резервной копии

source: Backup and Restore
ru: Резервное копирование и восстановление

source: Backups
ru: Резервные копии

source: Checks in the specified container for object older than the specified days. If i.e. 30 is specified, it will remove the remote object older than 30 days. Default: False (Disabled). The option --remove-older-then is deprecated and will be removed soon.
ru: Проверяет указанный контейнер на наличие объектов старше указанного количества дней. Если указано, например, 30, удалит удалённый объект старше 30 дней. По умолчанию: False (отключено). Параметр --remove-older-then устарел и будет удален в ближайшее время.

source: Checks the specified container and removes objects older than the provided datetime in the format YYYY-MM-DDThh:mm:ss i.e. 1974-03-25T23:23:23. Make sure the 'T' is between date and time.
ru: Проверяет указанный контейнер и удаляет объекты старше указанной даты и времени в формате ГГГГ-ММ-ДДTчч:мм:сс, например, 1974-03-25T23:23:23. Убедитесь, что между датой и временем находится символ 'T'.

source: Choose what you want to backup.
ru: Выберите для чего именно вы хотите создать резервную копию.

source: Cinder Volume ID
ru: ID диска Cinder

source: Client
ru: Клиент

source: Client ID
ru: ID клиента

source: Client is required
ru: Требуется клиент

source: Clients
ru: Клиенты

source: Clone Job
ru: Клонировать задание

source: Clone and edit a job file
ru: Клонировать и изменить файл задания

source: Compression Level
ru: Уровень сжатия

source: Container Name or Path
ru: Имя контейнера или путь

source: Continuous
ru: Непрерывный

source: Create Action
ru: Создать действие

source: Create Job
ru: Создать задание

source: Create Session
ru: Создать сессию

source: Created At
ru: Создана в

source: Days
ru: Дней

source: Define a name for this session
ru: Определить название для этой сесиии

source: Define extra information for the action executed by the client.
ru: Определите дополнительную информацию для действия, выполняемого клиентом.

source: Define the following action rules: <ul> <li>Number of retries</li> <li>Retries interval</li> <li>Action is mandatory</li> </ul>
ru: Определите следующие правила действий: <ul> <li>Количество повторных попыток</li> <li>Интервал повторных попыток</li> <li>Действие обязательно</li> </ul>

source: Delete Action
ru: Удалить действие

source: Delete Backup
ru: Удалить резервную копию

source: Delete Client
ru: Удалить клиента

source: Delete Job
ru: Удалить задание

source: Delete Job File
ru: Удалить файл задания

source: Delete Session
ru: Удалить сессию

source: Deleted Action
ru: Действие удалено

source: Deleted Action File
ru: Файл действия удален

source: Deleted Actions is not recoverable.
ru: Удаленные действия не подлежат восстановлению.

source: Deleted Backup
ru: Резервная копия удалена

source: Deleted Backups is not recoverable.
ru: Удаленные резервные копии не подлежат восстановлению.

source: Deleted Client
ru: Клиент удален

source: Deleted Clients is not recoverable.
ru: Удаленные клиенты не подлежат восстановлению.

source: Deleted Job
ru: Задание удалено

source: Deleted Job File
ru: Файл задания удален

source: Deleted Jobs is not recoverable.
ru: Удаленные задания не подлежат восстановлению.

source: Deleted Session
ru: Сессия удалена

source: Deleted Sessions is not recoverable.
ru: Удаленные сессии не подлежат восстановлению.

source: Describes actions to be executed by a client.
ru: Описывает действия, которые должен выполнить клиент.

source: Destination
ru: Место назначения

source: Destination File
ru: Файл назначения

source: Destination Path
ru: Путь назначения

source: Disable incremental feature. By default freezer build the meta data even for level 0 backup. By setting this option incremental meta data is not created at all. Default: Disabled.
ru: Отключить функцию инкрементного резервного копирования. По умолчанию Freezer создает метаданные даже для резервной копии уровня 0. При установке этого параметра инкрементные метаданные вообще не создаются. По умолчанию: отключено.

source: Do everything except writing or removing objects.
ru: Выполнить все, кроме записи или удаления объектов.

source: Download Limit
ru: Ограничение скачивания

source: Download bandwidth limit in Bytes per sec.. Can be invoked with dimensions (10K, 120M, 10G).
ru: Ограничение пропускной способности скачивания в байтах в секунду. Можно задать размерами (10 КБ, 120 МБ, 10 Гб).

source: Drag actions in the order they will be executed on the client.
ru: Перетаскивайте действия в том порядке, в котором они будут выполняться на клиенте.

source: Dry Run
ru: Пробный запуск

source: Edit
ru: Изменить

source: Edit Actions
ru: Изменить действия

source: Edit Job
ru: Изменить задание

source: Edit Session
ru: Изменить сессию

source: Encryption Key
ru: Ключ шифрования

source: End Date and Time
ru: Дата и время окончания

source: End date time is not in ISO format.
ru: Дата и время окончания не в формате ISO.

source: Enforce proxy that alters system HTTP_PROXY and HTTPS_PROXY.
ru: Включить прокси-сервер, который изменяет системные HTTP_PROXY и HTTPS_PROXY.

source: Engine to be used for backup/restore. With tar, the file inode will be checked for changes amid backup execution. If the file inode changed, the whole file will be backed up. With rsync, the data blocks changes will be verified and only the changed blocks will be backed up. Tar is faster, but is uses more space and bandwidth. Rsync is slower, but uses less space and bandwidth. Nova engine can be used to backup/restore running instances. Backing up instances and it's metadata.
ru: Движок, используемый для резервного копирования/восстановления. Tar проверяет индексный дескриптор файла на наличие изменений во время выполнения резервного копирования. Если индексный дескриптор файла изменился, будет создана резервная копия всего файла. Rsync проверяет изменения блоков данных и копирует только измененные блоки. Tar быстрее, но использует больше места и трафика. Rsync медленнее, но использует меньше места и трафика. Движок Nova можно использовать для резервного копирования/восстановления запущенных инстансов. Резервное копирование инстансов и их метаданных.

source: Error getting session list
ru: Ошибка получения списка сессий

source: Exclude Files
ru: Исключить файлы

source: Exclude files, given as a PATTERN. Example: '*.log, *.pyc' will exclude any file with name ending with .log. Default: no exclude.
ru: Исключить файлы, заданные ШАБЛОНОМ. Пример: '*.log, *.pyc' исключит все файлы с расширением .log. По умолчанию: без исключений.

source: File system
ru: Файловая система

source: Follow Symlinks
ru: Переход по символическим ссылкам

source: Follow hard and soft links and archive and dump the files they refer to. Default: False.
ru: Переходить по жестким и мягким ссылкам, архивировать и выгружать файлы, на которые они ссылаются. По умолчанию: False.

source: For Linux, in order to use snapshot features, the data has to reside on an LVM volume.
ru: В Linux, для использования функций снимков данные должны находиться на томе LVM.

source: From here you can add and remove clients to this job from the list of available clients
ru: Здесь вы можете добавлять и удалять клиентов для этого задания из списка доступных клиентов

source: Get A Single Object
ru: Получить один объект

source: Host
ru: Хост

source: Hostname
ru: Имя сервера

source: Hours
ru: Часов

source: ID of Cinder Volume for backup.
ru: ID диска Cinder для резервного копирования.

source: ID of Nova Instance for backup.
ru: ID инстанса Nova для резервного копирования.

source: ID of Nova Network for recover.
ru: ID сети Nova для восстановления.

source: IP address or DNS name of host to connect through SSH.
ru: IP-адрес или DNS-имя хоста для подключения по SSH.

source: In case of error, set the amount of retries for this job.
ru: В случае ошибки установите количество повторных попыток для данного задания.

source: Info
ru: Информация

source: Insecure
ru: Незащищенный

source: Interval
ru: Интервал

source: Interval Unit
ru: Единица интервала

source: Interval Value
ru: Значение интервала

source: Job
ru: Задание

source: Job Configuration
ru: Конфигурация задания

source: Job ID
ru: ID задания

source: Job Info
ru: Информация о задании

source: Job Name
ru: Имя задания

source: Job attached successfully.
ru: Задание успешно привязано.

source: Job executions can be executed and scheduled, by providing the following settings.
ru: Выполнение заданий можно выполнить и запланировать, указав следующие настройки.

source: Job has started
ru: Задание запущено

source: Job has stopped
ru: Задание остановлено

source: Job queued correctly. It will appear soon
ru: Задание поставлено в очередь правильно. Оно скоро появится

source: Job updated correctly.
ru: Задание обновлено ​​корректно.

source: Jobs
ru: Задания

source: Local Path
ru: Локальный путь

source: Log File Path
ru: Путь к файлу журнала

source: Lossless Data Compression (XZ)
ru: Сжатие данных без потерь (XZ)

source: Mandatory
ru: Обязательный

source: Max Level
ru: Максимальный уровень

source: Max Priority
ru: Максимальный приоритет

source: Max Retries
ru: Максимальное количество повторов

source: Max Retries Interval
ru: Максимальный интервал повторных попыток

source: Maximum Segment Size
ru: Максимальный размер сегмента

source: Minimum Compression (GZip/Zip/Zlib)
ru: Минимальное сжатие (GZip/Zip/Zlib)

source: Minutes
ru: Минут

source: Mode
ru: Режим

source: More Effective Compression (Bzip2)
ru: Более эффективное сжатие (Bzip2)

source: MySQL Configuration File
ru: Файл конфигурации MySQL

source: Name
ru: Имя

source: No Incremental
ru: Неинкрементальный

source: No clients found.
ru: Клиенты не найдены.

source: No clients selected.
ru: Клиенты не выбраны.

source: Nova Instance ID
ru: ID инстанса Nova

source: Nova Network ID
ru: ID сети Nova

source: OpenStack Authentication Version
ru: Версия аутентификации OpenStack

source: Path To Backup or Restore
ru: Путь к резервному копированию или восстановлению

source: Path for SSH private key.
ru: Путь к закрытому ключу SSH.

source: Please choose a interval unit
ru: Пожалуйста, выберите единицу измерения интервала

source: Please provide this value.
ru: Пожалуйста, укажите это значение.

source: Quiet
ru: Тихий

source: Remove From Date
ru: Удалить с даты

source: Remove Older Than
ru: Удалить старше чем

source: Restart Always Level
ru: Перезапустить постоянный уровень

source: Restart the backup from level 0 after N days. Valid only if --always-level option if set. If --always-level is used together with --remove-older-then, there might be the chance where the initial level 0 will be removed. Default: False (Disabled).
ru: Перезапустите резервное копирование с уровня 0 через N дней. Действует только если установлен параметр --always-level. Если --always-level используется вместе с --remove-older-then, существует вероятность удаления исходного уровня 0. По умолчанию: False (отключено).

source: Restore
ru: Восстановление

source: Restore Absolute Path
ru: Восстановить абсолютный путь

source: Restore From Date
ru: Восстановить с даты

source: Restore From Host
ru: Восстановить с хоста

source: Restore job successfully queued. It will get executed soon.
ru: Задание по восстановлению успешно поставлено в очередь. Оно будет выполнено в ближайшее время.

source: Result
ru: Результат

source: Rules
ru: Правила

source: SQL Server Configuration File
ru: Файл конфигурации SQL сервера

source: SSH Host
ru: SSH хост

source: SSH Private Key
ru: Закрытый ключ SSH

source: SSH Username
ru: Имя пользователя SSH

source: Save
ru: Сохранить

source: Seconds
ru: Секунд

source: Select A Session
ru: Выберите сессию

source: Selected Actions In Order
ru: Выбранные действия по порядку

source: Selected Clients
ru: Выбранные клиенты

source: Session
ru: Сессия

source: Session Configuration
ru: Конфигурация сессии

source: Session Information
ru: Информация о сессии

source: Session Name
ru: Имя сессии

source: Session queued correctly. It will appear soon
ru: Сессия поставлена в очередь корректно. Она скоро появится

source: Sessions
ru: Сессии

source: Set a name for this job
ru: Установите имя для этого задания

source: Set a session to attach this job
ru: Установите сессию, чтобы привязать это задание

source: Set backup maximum level used with tar to implement incremental backup. If a level 3 is specified, the backup will be executed from level 0 to level 3 and to that point always a backup level 3 will be executed. It will not restart from level 0. This option has precedence over --max-backup-level. Default: False (Disabled).
ru: Установите максимальный уровень резервного копирования, используемый tar для реализации инкрементного резервного копирования. Если указан уровень 3, резервное копирование будет выполняться с уровня 0 до уровня 3, и до этой точки всегда будет выполняться резервное копирование уровня 3. Перезапуск с уровня 0 не производится. Этот параметр имеет приоритет над --max-backup-level. По умолчанию: False (отключено).

source: Set hostname to execute actions. If you are executing freezer from one host but you want to delete objects belonging to another host then you can set this option that hostname and execute appropriate actions. Default: Current hostname.
ru: Задайте имя хоста для выполнения действий. Если вы запускаете Freezer с одного хоста, но хотите удалить объекты, принадлежащие другому, вы можете задать этот параметр, указав имя хоста и выполнив соответствующие действия. По умолчанию: текущее имя хоста.

source: Set log file. By default logs to /var/log/freezer.log If that file is not writable, Freezer tries to log to ~/.freezer/freezer.log
ru: Задать файл лога. По умолчанию логи ведутся в /var/log/freezer.log. Если этот файл недоступен для записи, Freezer пытается вести лог в ~/.freezer/freezer.log

source: Set storage backend for a backup.
ru: Настройте хранилище для резервного копирования.

source: Set the absolute path where you want your data restored.
ru: Укажите абсолютный путь, по которому вы хотите восстановить данные.

source: Set the absolute path where you want your data restored. Please provide datetime in format 'YYYY-MM-DDThh:mm:ss' i.e. '1979-10-03T23:23:23'. Make sure the 'T' is between date and time.
ru: Укажите абсолютный путь к папке, куда вы хотите восстановить данные. Укажите дату и время в формате 'ГГГГ-ММ-ДДTчч:мм:сс', например, '1979-10-03T23:23:23'. Убедитесь, что между датой и временем находится символ 'T'.

source: Set the action to be taken.
ru: Укажите действие, которое необходимо выполнить.

source: Set the backup level used with tar to implement incremental backup. If a level 1 is specified but no level 0 is already available, a level 0 will be done and subsequently backs to level 1. Default: 0 (No Incremental).
ru: Установите уровень резервного копирования, используемый tar для реализации инкрементного резервного копирования. Если указан уровень 1, но уровень 0 недоступен, будет создан уровень 0, а затем выполнен возврат к уровню 1. По умолчанию: 0 (без инкрементного).

source: Set the cpu process to the highest priority (i.e. -20 on Linux) and real-time for I/O. The process priority will be set only if nice and ionice are installed. Default: Disabled. Use with caution.
ru: Установите наивысший приоритет для процесса (например, -20 в Linux) и режим реального времени для ввода-вывода. Приоритет процесса будет установлен только при наличии установленных модулей nice и ionice. По умолчанию: отключено. Используйте с осторожностью.

source: Set the hostname used to identify the data you want to restore from. If you want to restore data in the same host where the backup was executed just type from your shell: '$ hostname' and the output is the value that needs to be passed to this option. Mandatory with Restore.
ru: Укажите имя хоста, используемое для идентификации данных, с которого вы хотите восстановить данные. Если вы хотите восстановить данные на том же хосте, где была создана резервная копия, просто введите в командной строке: '$ hostname', и в результате будет получено значение, которое необходимо передать в этот параметр. Обязательно для функции восстановления.

source: Set the interval between executions for retries in seconds.
ru: Установите интервал между выполнениями для повторных попыток в секундах.

source: Set the interval in the following format: continuous, N weeks, N days, N hours, N minutes, N seconds, If no start date is provided the job will start immediately
ru: Задайте интервал в следующем формате: непрерывно, N недель, N дней, N часов, N минут, N секунд, Если дата начала не указана, задание начнется немедленно

source: Set the interval value
ru: Установите значение интервала

source: Set the maximum file chunk size in bytes to upload to Swift. Default: 67108864 bytes (64MB).
ru: Установите максимальный размер фрагмента файла в байтах для загрузки в Swift. Значение по умолчанию: 67108864 байт (64 МБ).

source: Set the path where the MySQL configuration file is on the file system.
ru: Укажите путь к файлу конфигурации MySQL в файловой системе.

source: Set the path where the SQL Server configuration file is on the file system.
ru: Укажите путь к файлу конфигурации SQL сервера в файловой системе.

source: Set the path where the encryption key is on the file system.
ru: Укажите путь к ключу шифрования в файловой системе.

source: Set the unit for the Interval
ru: Установите единицу измерения для интервала

source: Set this action as mandatory.
ru: Установите это действие как обязательное.

source: Snapshot
ru: Снимок

source: Source File/Directory
ru: Исходный файл/каталог

source: Start Date and Time
ru: Дата и время начала

source: Start Job
ru: Запустить задание

source: Start date time is not in ISO format.
ru: Дата и время начала не в формате ISO.

source: Status
ru: Статус

source: Stop Job
ru: Остановить задание

source: Storage
ru: Хранилище

source: Suppress error messages.
ru: Подавлять сообщения об ошибках.

source: Swift auth version, could be 1, 2 or 3.
ru: Версия аутентификации Swift может быть 1, 2 или 3.

source: Swift container for Swift backend or path for SSH or local backend.
ru: Контейнер Swift для бэкенда Swift или путь для SSH или локального бэкенда.

source: The Object name you want to download on the local file system.
ru: Имя объекта, который вы хотите загрузить в локальную файловую систему.

source: The file name used to save the object on your local disk and upload file in Swift.
ru: Имя файла, используемое для сохранения объекта на локальном диске и загрузки файла в Swift.

source: The file or directory you want to backup.
ru: Файл или каталог, для которого вы хотите создать резервную копию.

source: The path in which the backup should be restored
ru: Путь, по которому следует восстановить резервную копию

source: The snapshot technologies currently supported are LVM for Linux and Volume Shadow Copy for Windows.
ru: В настоящее время поддерживаются следующие технологии снимков: LVM для Linux и Volume Shadow Copy для Windows.

source: Unable to attach to session.
ru: Не удалось привязать к сессии.

source: Unable to create session.
ru: Не удалось создать сессию.

source: Unable to created job.
ru: Не удалось создать задание.

source: Unable to retrieve client list.
ru: Не удалось получить список клиентов.

source: Unable to save action file.
ru: Не удалось сохранить файл действия.

source: Unable to save actions.
ru: Не удалось сохранить действия.

source: Unable to update actions.
ru: Не удалось обновить действия.

source: Unable to update job.
ru: Не удалось обновить задание.

source: Update Actions
ru: Обновить действия

source: Update Job
ru: Обновить задание

source: Upload Limit
ru: Ограничение загрузки

source: Upload bandwidth limit in Bytes per sec.. Can be invoked with dimensions (10K, 120M, 10G).
ru: Ограничение пропускной способности загрузки в байтах в секунду. Можно задать размерами (10 КБ, 120 МБ, 10 Гб).

source: Use a LVM or Shadow Copy snapshot to have point in time consistent backups.
ru: Используйте снимок LVM или Shadow Copy для создания резервных копий, соответствующих определенному моменту времени.

source: Weeks
ru: Недель

source: You must define Cinder Volume ID to backup.
ru: Для резервного копирования необходимо указать ID диска Cinder.

source: You must define Nova Instance ID to restore or backup.
ru: Для восстановления или резервного копирования необходимо указать ID инстанса Nova.

source: You must define Nova Network ID to restore.
ru: Для восстановления необходимо указать ID сети Nova.

source: You must define a container or path to backup.
ru: Необходимо определить контейнер или путь для резервного копирования.

source: You must define a path to backup.
ru: Необходимо указать путь к резервной копии.

source: You must define a path to restore.
ru: Необходимо указать путь для восстановления.

source: You must define an action name.
ru: Необходимо определить имя действия.
